Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: A database in which changes are stored. Some version control systems are centralized: there is a single, master repository, which stores all changes to the project. Others are decentralized: each developer has his own repository, and changes can be swapped back and forth between repositories arbitrarily. The version control system keeps track of dependencies between changes, and when it's time to make a release, a particular set of changes is approved for that release. The question of whether centralized or decentralized is better is one of the enduring holy wars of software development; try not to fall into the trap of arguing about it on your project lists.
gl: Unha base de datos na que se almacenan as mudanzas. Algúns sistemas de control de versións están centralizados: hai un único repositorio no que se almacenan todos as mudanzas do proxecto. Outros son descentralizados: cada desenvolvedor garda o seu propio repositorio, e as mudanzas poden ser trocadas entre repositorios arbitrariamente. O sistema de control de versións mantén o seguimento das dependencias entre mudanzas, e cando chega a hora de liberar unha nova versión, un conxunto concreto de mudanzas é aprobado para esa versión. A cuestión sobre se é mellor a centralización ou a descentralización é unha das guerras santas máis longas do desenvolvemento de software; tenta non caer na trampa de discutires sobre este asunto nas listas de correo do teu proxecto.

source: The process of obtaining a copy of the project from a repository. A checkout usually produces a directory tree called a "working copy" (see below), from which changes may be committed back to the original repository. In some decentralized version control systems, each working copy is itself a repository, and changes can be pushed out to (or pulled into) any repository that's willing to accept them.
gl: O proceso de descarregar unha copia do proxecto desde un repositorio. Un checkout xera normalmente unha árbore de directorios chamada "copia de traballo" (ver debaixo), desde a que as mudanzas poden ser enviadas novamente ao repositorio orixinal. Nalgúns sistemas de control de versións descentralizados, cada copia de traballo é ao tempo un repositorio, e as mudanzas poden ser enviadas (ou traídas de) calquera outro repositorio que as acepte.

source: working copy
gl: copia de traballo

source: A developer's private directory tree containing the project's source code files, and possibly its web pages or other documents. A working copy also contains a little bit of metadata managed by the version control system, telling the working copy what repository it comes from, what "revisions" (see below) of the files are present, etc. Generally, each developer has his own working copy, in which he makes and tests changes, and from which he commits.
gl: A árbore de directorios dun desenvolvedor que contén os ficheiros de código fonte e, posiblemente, as súas páxinas web ou outros documentos. Unha copia de traballo contén tamén un certo número de metadatos xeridos polo sistema de control de versións, que lle din de que repositorio vén, que "revisións" (ver máis abaixo) contén, etc. Xeralmente, cada desenvolvedor mantén a súa propia copia de traballo, na que fai e comproba as mudanzas, e desde a que fai os commits.

source: <firstterm>revision</firstterm>, <firstterm>change</firstterm>, <firstterm>changeset</firstterm>
gl: <firstterm>conxunto de mudanzas(changeset) </firstterm>, <firstterm>mudanza</firstterm>, <firstterm>revisión</firstterm>

source: A "revision" is usually one specific incarnation of a particular file or directory. For example, if the project starts out with revision 6 of file F, and then someone commits a change to F, this produces revision 7 of F. Some systems also use "revision", "change", or "changeset" to refer to a set of changes committed together as one conceptual unit.
gl: Unha "revisión" é xeralmente a encarnación dun ficheiro ou directorio en particular. Por exemplo, se o proxecto comeza coa revisión 6 do ficheiro F, e despois alguén fai un commit cunha mudanza a F, isto produce a revisión 7 de F. Algúns sistemas usan tamén "revisión", "mudanza" ou "changeset" para se referiren a un conxunto de mudanzas subidas todas xuntas nun único commit como unha unidade conceptual

source: These terms occasionally have distinct technical meanings in different version control systems, but the general idea is always the same: they give a way to speak precisely about exact points in time in the history of a file or a set of files (say, immediately before and after a bug is fixed). For example: "Oh yes, she fixed that in revision 10" or "She fixed that in revision 10 of foo.c."
gl: Estes termos teñen ocasionalmente diferentes significados técnicos en diferentes sistemas de control de versións, mais a idea máis estendida é sempre a mesma: son a maneira de falar con precisión acerca de puntos temporais concretos na historia dun ficheiro ou un conxunto de ficheiros (digamos, inmediatamente antes e despois de que un erro é reparado). Por exemplo: "ó, si, reparou ese problema na revisión 10" ou "reparou iso na revisión 10 de foo.c"

source: When one talks about a file or collection of files without specifying a particular revision, it is generally assumed that one means the most recent revision(s) available.
gl: Cando un fala sobre un ficheiro ou colección de ficheiros sen especificar unha revisión en particular, xeralmente se asume que se está a referir a(s) revisión(s) máis recentes.

source: "Version" Versus "Revision"
gl: "Versión" fronte a "Revisión"

source: The word <firstterm>version</firstterm> is sometimes used as a synonym for "revision", but I will not use it that way in this book, because it is too easily confused with "version" in the sense of a version of a piece of software&mdash;that is, the release or edition number, as in "Version 1.0". However, since the phrase "version control" is already standard, I will continue to use it as a synonym for "revision control" and "change control".
gl: A palabra <firstterm>versión</firstterm> ás veces é usada como sinónimo de "revisión", mais eu non o vou usar nese sentido neste libro, porque é demasiado fácil confundilo co termo "versión" tal como cando se fala de versións dun software&mdash;isto é, o número de liberación ou distribución, como en "Versión 1.0". De todos os xeitos, como a expresión "control de versións" é de feito estándar, eu vou continuar a empregala como sinónimo de "control de revisión" e "control de mudanzas".

source: A textual representation of a change. A diff shows which lines were changed and how, plus a few lines of surrounding context on either side. A developer who is already familiar with some code can usually read a diff against that code and understand what the change did, and even spot bugs.
gl: Representación textual dunha mudanza. Un "diff" mostra que liñas foron mudadas e como, ademais dunhas poucas liñas de contextualización desa información. Un desenvolvedor que estea familiarizado cun código dado, poderá ler o diff comparándoo co código e entender que foi o que se mudou, e mesmo localizar erros.

source: <firstterm>tag</firstterm>
gl: <firstterm>etiqueta (tag)</firstterm>

source: A label for a particular collection of files at specified revisions. Tags are usually used to preserve interesting snapshots of the project. For example, a tag is usually made for each public release, so that one can obtain, directly from the version control system, the exact set of files/revisions comprising that release. Common tag names are things like <literal>Release_1_0</literal>, <literal>Delivery_00456</literal>, etc.
gl: Designan coleccións particulares de ficheiros pertencentes a unha revisión específica. As etiquetas xeralmente son usadas para preservar fitos interesantes dun proxecto. Por exemplo, frecuentemente se lle adxudica unha etiqueta a cada versión liberada, de tal xeito que se poida obter, directamente dende o sistema de control de versións, o conxunto exacto de ficheiros que compoñen esa versión. Os nomes que se acostuman empregar para as etiquetas poden ser do estilo de: <literal>Versión_1_0</literal>, <literal>Distribución_00456</literal>, etc.

source: branch
gl: rama (branch)

source: A copy of the project, under version control but isolated, so that changes made to the branch don't affect the rest of the project, and vice versa, except when changes are deliberately "merged" from one side to the other (see below). Branches are also known as "lines of development". Even when a project has no explicit branches, development is still considered to be happening on the "main branch", also known as the "main line" or "<firstterm>trunk</firstterm>".
gl: Unha copia do proxecto, baixo o control de versións mais individualizada, tal que as mudanzas feitas á rama non afectan ao resto do proxecto, e viceversa, excepto cando as mudanzas son fusionadas (merged) desde unha rama a outra (ver debaixo). As ramas son tamén coñecidas como "liñas de desenvolvemento". Mesmo cando un proxecto non ten ramas, considérase que o desenvovemento se está a facer na "rama principal (main branch)", tamén coñecida como "liña principal (main line)" ou" <firstterm>tronco (trunk)</firstterm>".

source: Branches offer a way to isolate different lines of development from each other. For example, a branch can be used for experimental development that would be too destabilizing for the main trunk. Or conversely, a branch can be used as a place to stabilize a new release. During the release process, regular development would continue uninterrupted in the main branch of the repository; meanwhile, on the release branch, no changes are allowed except those approved by the release managers. This way, making a release needn't interfere with ongoing development work. See <xref linkend="branches"/><phrase output="printed"> later in this chapter</phrase> for a more detailed discussion of branching.
gl: As ramas ofrecen unha maneira de isolar entre si diferentes liñas de desenvolvemento que poderían desestabilizar o tronco principal. Ou alternativamente, unha rama pode ser empregada para estabilizar unha nova versión. Durante o proceso de liberación, o desenvolvemento normal do proxecto pode continuar na rama principal do repositorio; mentres tanto, na rama da liberación, non se permite introducir novas mudanzas distintas das aprobadas polos xestores da liberación. Así, facer unha liberación non ter por que interferir cos traballos de desenvolvemento. Podes consultar <xref linkend="ramas (branches)"/><phrase output="printed"> máis adiante neste capítulo</phrase> se precisares máis detalles sobre a creación de ramas.

source: merge (a.k.a. port)
gl: fusionar ("merge", ou "port")

source: To move a change from one branch to another. This includes merging from the main trunk to some other branch, or vice versa. In fact, those are the most common kinds of merges; it is rare to port a change between two non-main branches. See <xref linkend="vc-singularity"/> for more about this kind of merging.
gl: Trasladar unha mudanza entre ramas. Inclúe fusionar desde o tronco principal a unha rama ou viceversa. De feito, estas son precisamente as fusións máis frecuentes; é raro facer fusións entre ramas secundarias do proxecto. Podes ver máis información sobre este tema en <xref linkend="vc-singularity"/>.

source: "Merge" has a second, related meaning: it is what the version control system does when it sees that two people have changed the same file but in non-overlapping ways. Since the two changes do not interfere with each other, when one of the people updates their copy of the file (already containing their own changes), the other person's changes will be automatically merged in. This is very common, especially on projects where multiple people are hacking on the same code. When two different changes <emphasis>do</emphasis> overlap, the result is a "conflict"; see below.
gl: "Fusionar (merge)" ten un segundo significado, relacionado co anterior: é o que fai o sistema de control de versións cando detecta que dúas persoas fixeron mudanzas a un mesmo ficheiro, mais en aspectos que non se sobrepoñen. Dado que as dúas mudanzas non interfiren entre si, cando un dos desenvolvedores actualiza a súa copia do ficheiro (contendo aínda as súas propias mudanzas), as mudanzas feitas polo segundo desenvolvedor fusiónanse automaticamente cos anteriores. Isto é moi frecuente, especialmente en proxectos nos que moitas persoas están traballando sobre o mesmo código. Cando dúas mudanzas diferentes <emphasis>interfiren</emphasis>, o resultado é un "conflicto".

source: conflict
gl: conflicto

source: What happens when two people try to make different changes to the same place in the code. All version control systems automatically detect conflicts, and notify at least one of the humans involved that their changes conflict with someone else's. It is then up to that human to <firstterm>resolve</firstterm> the conflict, and to communicate that resolution to the version control system.
gl: É o que sucede cando dúas persoas tratan de facer mudanzas diferentes sobre a mesma porción de código. Todos os sistemas de control de versións detectan automaticamente os conflitos, e lle notifican a cando menos un dos desenvolvedores implicados que as súas mudanzas entran en conflito coas de alguén máis. <firstterm>Resolver</firstterm> o conflicto e comunicarllo ao sistema fica entón na man desa persoa.

source: lock
gl: bloquear (lock)

source: A way to declare an exclusive intent to change a particular file or directory. For example, "I can't commit any changes to the web pages right now. It seems Alfred has them all locked while he fixes their background images." Not all version control systems even offer the ability to lock, and of those that do, not all require the locking feature to be used. This is because parallel, simultaneous development is the norm, and locking people out of files is (usually) contrary to this ideal.
gl: É unha maneira de declarar un intento de introducir mudanzas en exclusiva nun ficheiro ou directorio dado. Por exemplo: "Non podo subir ningunha mudanza ás páxinas web neste momento. Alfred as ten bloqueadas mentres corrixe as imaxes do fondo". Non todos os sistemas de control de versións ofrecen a posibilidade de facer bloqueos, e entre os que si o fan, non todos esixen que se empregue o bloqueo. Isto é así porque o desenvolvemento simultáneo e en paralelo é a norma, e bloquear a xente que pretende traballar sobre os ficheiros é (xeralmente) contrario a este ideal.

source: Version control systems that require locking to make commits are said to use the <firstterm>lock-modify-unlock</firstterm> model. Those that do not are said to use the <firstterm>copy-modify-merge</firstterm> model. An excellent in-depth explanation and comparison of the two models may be found at <ulink url="http://svnbook.red-bean.com/svnbook-1.0/ch02s02.html"></ulink>. In general, the copy-modify-merge model is better for open source development, and all the version control systems discussed in this book support that model.
gl: Os sistemas de control de versións que requiren do uso do bloqueo para poder subir cambios son coñecidos como modelos do tipo <firstterm>bloqueo-modificación-desbloqueo</firstterm>. Os que non, son denominados modelos <firstterm>copia-modificación-refundido</firstterm>. Unha comparación excelente entre os dous modelos pode ser consultada en <ulink url="http://svnbook.red-bean.com/svnbook-1.0/ch02s02.html"></ulink>. En xeral, o modelo copia-modificación-refundido se considera mellor para o desenvolvemento de software libre, e todos os sistemas de control de versións que se comentan neste libro soportan o dito modelo.

source: Choosing a Version Control System
gl: Seleccionando un sistema de control de versións

source: As of this writing, the two most popular version control systems in the free software world are <firstterm>Concurrent Versions System</firstterm> (<firstterm>CVS</firstterm>, <ulink url="http://www.cvshome.org/"></ulink>) and <firstterm>Subversion</firstterm> (<firstterm>SVN</firstterm>, <ulink url="http://subversion.tigris.org/"></ulink>).
gl: Cando este libro foi escrito, os dous sistemas de control de versións máis populares no mundo do software libre eran <firstterm>Concurrent Versions System</firstterm> (<firstterm>CVS</firstterm>, <ulink url="http://www.cvshome.org/"></ulink>) e <firstterm>Subversion</firstterm> (<firstterm>SVN</firstterm>, <ulink url="http://subversion.tigris.org/"></ulink>).

source: CVS has been around for a long time. Most experienced developers are already familiar with it, it does more or less what you need, and since it's been popular for a long time, you probably won't end up in any long debates about whether or not it was the right choice. CVS has some disadvantages, however. It doesn't provide an easy way to refer to multi-file changes; it doesn't allow you to rename or copy files under version control (so if you need to reorganize your code tree after starting the project, it can be a real pain); it has poor merging support; it doesn't handle large files or binary files very well; and some operations are slow when large numbers of files are involved.
gl: CVS está dispoñible desde hai moito tempo. Os desenvolvedores máis experimentados están familiarizados dabondo con el, fai máis ou menos o que precisas, e como é popular dende hai tempo, probablemente non teñas que enredarte en longas discusións sobre se é ou non a opción máis axeitada. Porén, CVS tamén ten algunhas desvantaxes. Non subministra unha maneira doada de tratar cen mudanzas multi-ficheiro; non te deixa renomear ou copiar os ficheiros dentro do sistema de control (así que tentar reorganizar a árbore do código do teu proxecto, unha vez xa iniciado, pode tornarse nun auténtico pesadelo); o seu soporte para as fusións é moi pobre; non manexa nada ben os ficheiros moi grandes ou os binarios; e algunhas operacións son moi lentas cando se fan sobre un número grande de ficheiros.

source: None of CVS's flaws is fatal, and it is still quite popular. However, in the last few years the more recent Subversion has been gaining ground, especially in newer projects.<footnote><para>See <ulink url="http://cia.vc/stats/vcs"></ulink> and <ulink url="http://subversion.tigris.org/svn-dav-securityspace-survey.html"></ulink> for evidence of this growth.</para></footnote>. If you're starting a new project, I recommend Subversion.
gl: Ningún dos fallos de CVS é fatal, e aínda é moi popular. Porén, nos últimos anos o máis recente Subversion está a gañar terreo, especialmente nos proxectos máis novos. <footnote><para>Véxase <ulink url="http://cia.vc/stats/vcs"></ulink> e <ulink url="http://subversion.tigris.org/svn-dav-securityspace-survey.html"></ulink> onde se comentan probas deste crecemento.</para></footnote>. Se estás iniciando un proxecto novo, eu recoméndoche Subversion

source: On the other hand, since I'm involved in the Subversion project, my objectivity might reasonably be questioned. And in the last few years a number of new open-source version control systems have appeared. <xref linkend="vc-systems"/> lists all the ones I know of, in rough order of popularity. As the list makes clear, deciding on a version control system could easily become a lifelong research project. Possibly you will be spared the decision because it will be made for you by your hosting site. But if you must choose, consult with your other developers, ask around to see what people have experience with, then pick one and run with it. Any stable, production-ready version control system will do; you don't have to worry too much about making a drastically wrong decision. If you simply can't make up your mind, then go with Subversion. It's fairly easy to learn, and is likely to remain a standard for at least a few years.
gl: Pola contra, dado que eu estou participando no proxecto Subversion, a miña obxectividade pode ser razoablemente discutida. E nos últimos anos teñen xurdido un certo número de novos sistemas de control de versións en software libre. En <xref linkend="vc-systems"/>,presento unha listaxe , ordenadas máis ou menos por orde de popularidade. Como a listaxe deixa claro, decidirse por un sistema de control de versións podería tornarse nun proxecto vitalicio en si mesmo. Posiblemente vaste ver liberado desta decisión porque o fará por ti o sitio no que teñas hospedado o teu proxecto. Mais se es ti quen ten que tomar a decisión, consúltao co resto dos desenvolvedores, investiga que experiencia teñen ao respecto, e despois escolle un sistema e traballa con el. Calquera sistema de control de versións estable e listo para a produción vai satisfacer as túas necesidades; non deberías preocuparte moito sobre se tomaches unha decisión radicalmente errónea. Se simplemente non dás tomado unha decisión, entón elixe Subversion. É moi doado de aprender, e seguramente vai seguir sendo un estándar por moitos anos.

source: Using the Version Control System
gl: Usando o sistema de control de versións

source: The recommendations in this section are not targeted toward a particular version control system, and should be simple to implement in any of them. Consult your specific system's documentation for details.
gl: As recomendacións desta sección non se dirixen a un sistema de control de versións en particular, e deberían ser doadas de poñer en práctica en calquera deles. Consulta a documentación do teu sistema específico se precisares máis detalles.

source: Version everything
gl: Versiona todo.

source: Keep not only your project's source code under version control, but also its web pages, documentation, FAQ, design notes, and anything else that people might want to edit. Keep them right next to the source code, in the same repository tree. Any piece of information worth writing down is worth versioning&mdash;that is, any piece of information that could change. Things that don't change should be archived, not versioned. For example, an email, once posted, does not change; therefore, versioning it wouldn't make sense (unless it becomes part of some larger, evolving document).
gl: Debes manter no teu sistema de control de versións non só o código fonte do teu proxecto, senón tamén as súas páxinas web, documentación, FAQ, notas de deseño, e calquera outra cousa que a xente poida querer editar. Mantenas xusto a carón do código, na mesma árbore do repositorio. Calquera peza de información que pague a pena escribir, paga igualmente a pena versionar&mdash;isto é, calquera peza de información que poida ser modificada. As cousas que non están sometidas a mudanzas deberían ser arquivadas, non versionadas. Por exemplo, un email, unha vez enviado, non vai mudar; polo tanto, non tería sentido pensar en que pode ser versionado (a non ser que forme parte dun documento máis longo e que si evolúa no tempo).
